app/Controllers/AdminController.php

SELECT *
FROM `orders`
WHERE `orders`.`id` = '7'
UPDATE `orders` SET `status` = 'Selesai'
WHERE `orders`.`id` IN ('7')
---
    public function updateStatus()
{
    $id = $this->request->getPost('id');
    $status = $this->request->getPost('status');

    $orderModel = new \App\Models\OrderModel();
    $order = $orderModel->find($id);

    if ($order) {
        $orderModel->update($id, ['status' => $status]);

SELECT *
FROM `orders`
WHERE `payment` = 'qris'
ORDER BY `created_at` DESC
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `orders`
WHERE `payment` = 'qris'
SELECT *
FROM `orders`
WHERE `payment` = 'cash'
ORDER BY `created_at` DESC
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `orders`
WHERE `payment` = 'cash'
SELECT *
FROM `orders`
ORDER BY `created_at` DESC
 LIMIT 10
SELECT SUM(`total_harga`) AS `total_harga`
FROM `orders`
SELECT COUNT(*) AS `numrows`
FROM `orders`
WHERE `status` = 'Selesai'
SELECT COUNT(*) AS `numrows`
FROM `orders`
WHERE `status` != 'Selesai'
---
    public function dashboard()
{
    if (!session()->get('admin_logged_in')) {
        return redirect()->to('/admin/login');
    }

    $payment = $this->request->getGet('payment');
    $orderModel = new \App\Models\OrderModel();

    $perPage = 10;
    $currentPage = $this->request->getGet('page') ?? 1;

    if ($payment) {
        $orders = $orderModel->where('payment', $payment)
                             ->orderBy('created_at', 'DESC')
                             ->paginate($perPage);
    } else {
        $orders = $orderModel->orderBy('created_at', 'DESC')
                             ->paginate($perPage);
    }

    // Tambahan perhitungan statistik
    $totalIncome = $orderModel->selectSum('total_harga')->get()->getRow()->total_harga ?? 0;
    $successCount = $orderModel->where('status', 'Selesai')->countAllResults();
    $failedCount = $orderModel->where('status !=', 'Selesai')->countAllResults();