app/Controllers/OrderController.php

INSERT INTO `orders` (`order_id`, `email`, `menu`, `size`, `jumlah`, `harga`, `total_harga`, `deskripsi`, `catatan`, `payment`) VALUES ('ORD-011', 'valinapuspitasari538@gmail.com', 'coklat', 'small', 2, 24000, 48000, 'Coklat Hangat Cahaya Senja – Peluk manis saat petang tiba.', '', 'qris')
---

    // ✅ SIMPAN DATABASE
    $orderModel = new OrderModel();
    $orderModel->insert([
        'order_id'    => $orderId,
        'email'       => $emailTo,
        'menu'        => $menu,
        'size'        => $size,
        'jumlah'      => $jumlah,
        'harga'       => $harga,
        'total_harga' => $totalHarga,
        'deskripsi'   => $deskripsi,
        'catatan'     => $catatan,
        'payment'     => $payment
    ]);

SELECT *
FROM `orders`
WHERE `orders`.`id` = '6'
DELETE FROM `orders`
WHERE `id` IN ('6')
---
public function delete($id)
{
    $orderModel = new \App\Models\OrderModel();

    $order = $orderModel->find($id);
    if ($order) {
        // Jika ada bukti bayar, hapus filenya
        if (!empty($order['bukti_bayar'])) {
            $path = FCPATH . 'uploads/bukti_bayar/' . $order['bukti_bayar'];
            if (file_exists($path)) {
                unlink($path);
            }
        }

        $orderModel->delete($id);